Merge pull request #427 from cgwalters/mermaid
README.md: Switch to mermaid for arch visualization
